In [13]:
from pandas import DataFrame
df=DataFrame(
                [
                    ["aryan","singh","fulltime","administration",2,20000],
                    ["rohan","agarwal","intern","technical",1,5000],
                    ["riya","shah","fulltime","administration",5,10000],
                    ["yash","bhatiya","parttime","technical",3,10000],
                    ["siddhant","khanna","fulltime","management",6,20000]
                ]
                ,columns=["first Name","last name","type","department","YoE","Salary"]
            )
df

  first Name last name      type      department  YoE  Salary
0      aryan     singh  fulltime  administration    2   20000
1      rohan   agarwal    intern       technical    1    5000
2       riya      shah  fulltime  administration    5   10000
3       yash   bhatiya  parttime       technical    3   10000
4   siddhant    khanna  fulltime      management    6   20000

 Make a pivot table which shows average salary of each type of employee for each
department.

In [14]:
import pandas as pd
table=pd.pivot_table(df,index='type',columns='department',values='Salary')
table

department  administration  management  technical
type
fulltime           15000.0     20000.0        NaN
intern                 NaN         NaN     5000.0
parttime               NaN         NaN    10000.0

Make a pivot table which shows the sum and mean of the salaries of each type of
employee and the number of employees of each type

In [16]:
table=pd.pivot_table(df,index='type',values='Salary',aggfunc=['sum','mean'])
table

            sum          mean
         Salary        Salary
type
fulltime  50000  16666.666667
intern     5000   5000.000000
parttime  10000  10000.000000

In [22]:
table=pd.pivot_table(df,index='type',values='Salary',aggfunc=['sum','mean','count'])
table

            sum          mean  count
         Salary        Salary Salary
type
fulltime  50000  16666.666667      3
intern     5000   5000.000000      1
parttime  10000  10000.000000      1

display a pivot table to cunt survival by gender , categories wise age of various classes age 0-10 cat1,10-30 cat2,30-60 cat3,cat4 60-80

In [2]:
import pandas as pd
import numpy as np
dft = pd.read_csv("dataset/titanic.csv")
dft
#table=pd

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,NaN,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,NaN,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,NaN,NaN,S
3,4,NaN,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0.0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1.0,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0.0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1.0,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0.0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [26]:
table=pd.pivot_table(dft,index=['Sex'],values=['Survived'],columns=['Pclass'],aggfunc=['count'])
table

          count
       Survived
Pclass        1    2    3
Sex
female       92   76  143
male        122  108  346